/*
DIFFERENT METHODS======================================
 1. type(of: параметр)
        Возвращает тип переданного параметра.
 2. zip (seq1, seq2)
        Возвращает последовательность кортежей состоящей из двух последовательностей seq1 и seq2
        При этом если одна из передоывемых в фунецию последовательностей короче дугой, то итогова
        последовательность будет наикроточайшей длинны.
 3. arc4random_uniform(числоВUint32)
        Возвращает случайное значенние типа Uint32, в диапазоне от 0 до числоВUint32
 4. коллекция.randomElement()
        Возвращает рандомный элемент из коллекции или nil если коллекция пуста.
 
 
 NUMBERS METHODS=======================================
 1. целое/дробноеЧисло.truncatingRemainder(dividingBy: целое/дробноеЧисло)
        Возвращает остаток от деления у целого или дробного числа.
 2. целоеЧислою1.isMultiple(of: целоеЧисло2)
        Возвращает true если число1 кратно чуслу2 и false если нет.
 3. Тип(значение)
        Метод приводит к данному типу данное значение.
    Int(3.14)                               // 3
    Double(13)                              // 13.0
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 */
