/*
DIFFERENT METHODS======================================
 1.
 2.
 3.
 
 
 NUMBERS METHODS=======================================
 1. целое/дробноеЧисло.truncatingRemainder(dividingBy: целое/дробноеЧисло)
        Возвращает остаток от деления у целого или дробного числа.
 2. целоеЧислою1.isMultiple(of: целоеЧисло2)
        Возвращает true если число1 кратно чуслу2 и false если нет.
 3. Тип(значение)
        Метод приводит к данному типу данное значение.
    Int(3.14)                               // 3
    Double(13)                              // 13.0
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 */
