/*
OTHER
 
 Системы исчисления================================================
 0b00000001        // 1        Двоичная
 0o11              // 9        Восьмеричная
 0xE               // 14       Шестнадцатиричной
 
 
 Экспаненциальная запись===========================================
 1.25e2 соответствует 1,25 × 10^2, или 125,0
 0xFp-2 соответствует 15 × 2^–2, или 3,75
 
 
 Оператор guard для опционалов=====================================
 стр 285
 
 Оператор отложенных действий defer================================
 стр 286
 
 
 
 
 
 */
