/*
BASIC TYPES
 
 STRING=============================================================
    let myName: String = "Andrey"
        or
    var myCityName = ""
 
 var phrase = "My name is "
 phrase += "Andrey"             // "My name is Andrey"
 phrase += " \(1 + 4)"          // "My name is Andrey 5"
 
 
 
 
 
 INT================================================================
    let myBirthYear: Int = 1988
        or
    var myAge = 35
 
 
 FLOAT==============================================================
    Содержит до 6 чисел в дробной части.
    Если не задать тип явно то по умолчанию будет Double.
    let pi: Float = 3.14
 
 
 DOUBLE=============================================================
 Содержит до 15 чисел в дробной части.
    let pi: Double = 3.14
        or
    var num = 432.5432
 
 
 BOOL===============================================================
    let isExist: Bool = true
        or
    var isOn = false
 
 
 При создании константы let num: int и не инициализации ей значения,
 это можно сделать потом, но один раз так как это константа.
 */
