/*
OOP THESIS
 
 1. В swift всё есть объект! Например число 3 это объект класса Int,
    который обладает своими свойствами и методами. Так например создать
    объект 2 можно с помощью метода .init()
        let num = Int.init(2)                       // 2
            or
        let num = Int(2)                            // 2

 2. ЭКЗЕМПЛЯР - это конкретный объект определенного класса имеющий свои свойства и методы,
    например есть класс building, и есть эеземпляр этого класса cottage^ который в совю
    очередь может иметь такие свойства, как
     cottage.floorsNumber = 2
     cottage.roomsNumber = 6
     cottage.buildingArea = 210
    и такой метод как
     cottage.openDoorWith(identifier:)
 
 3. МОДУЛИ - блоки кода вплодь до библиотек и фреймворков, например Foundation
    (Cocoa's Foundation Framework)
 
 4. ПРОСТРАНСТВО ИМЁН - ???????????????????????????????????????????????
 
 5. Swift API Design Guideline — это своеобразная дорожная карта, собравшая правила,
    благодаря которым синтаксис языка стал четким, понятным и приятным.
 
 
 ЧЕТЫРЕ МЕХАНИЗМА СОЗДАНИЯ ОБЪЕКТОВ====================================
 
 1. Перечисления (enum)
 2. Структуры (struct)
 3. Классы (class)
 4. Протоколы (protocol)
 
 */
